#Область СтандартныеСобытия

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Календарь = ТекущаяДата();
	
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнениеПланировщикаНаСервере();
	
	СвободныеОкнаВрачей.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеЗаписи" Тогда
		ЗаполнениеПланировщикаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПланировщика

&НаСервере
Процедура ЗаполнениеПланировщикаНаСервере()
	
	СвободныеОкнаВрачей.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаписиКВрачуСрезПоследних.НачалоПриема КАК НачалоПриема,
		|	ЗаписиКВрачуСрезПоследних.ОкончаниеПриема КАК ОкончаниеПриема,
		|	ЗаписиКВрачуСрезПоследних.Пациент КАК Пациент,
		|	ЗаписиКВрачуСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЗаписиКВрачуСрезПоследних.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрСведений.ЗаписиКВрачу.СрезПоследних(, ) КАК ЗаписиКВрачуСрезПоследних
		|ГДЕ
		|	ЗаписиКВрачуСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйЭлемент = СвободныеОкнаВрачей.Элементы.Добавить(Выборка.НачалоПриема,
															Выборка.ОкончаниеПриема);
		НовыйЭлемент.Значение = Выборка.Ссылка;
		НовыйЭлемент.Текст = Выборка.Пациент;
		НовыйЭлемент.ЦветФона = WebЦвета.Зеленый;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодОтображенияПланировщика()
	
	Начало = НачалоДня(Календарь) + 8 * 3600;
	Конец = НачалоДня(Календарь) + 20 * 3600;
	
	СвободныеОкнаВрачей.ТекущиеПериодыОтображения.Очистить();
	
	СвободныеОкнаВрачей.ТекущиеПериодыОтображения.Добавить(Начало, Конец);
	СвободныеОкнаВрачей.НачалоПериодаОтображения = Начало;
	СвободныеОкнаВрачей.КонецПериодаОтображения = Конец;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеСобытияРеквизитов

&НаКлиенте
Процедура СвободныеОкнаВрачейПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = СвободныеОкнаВрачейПередСозданиемНаСервере(Начало);
	
	Если СтруктураПараметров <> 0 Тогда
		ОткрытиеОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("Документ.ЗаписьКВрачу.ФормаОбъекта", СтруктураПараметров, , , , , , ОткрытиеОкна);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У врача не задан кабинет";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СвободныеОкнаВрачейПередСозданиемНаСервере(Начало)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КабинетВрачаСрезПоследних.НомерКабинета КАК НомерКабинета,
		|	Сотрудники.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.КабинетВрача.СрезПоследних КАК КабинетВрачаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО КабинетВрачаСрезПоследних.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	КабинетВрачаСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("ДатаНачалаПриема", Начало);
		ЗначенияДляЗаполнения.Вставить("Врач", Сотрудник);
		ЗначенияДляЗаполнения.Вставить("НомерКабинета", Выборка.НомерКабинета);
		ЗначенияДляЗаполнения.Вставить("ДолжностьВрача", Выборка.Должность);
		СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияДляЗаполнения);
		
		Возврат СтруктураПараметров;
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СвободныеОкнаВрачейПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыделенныйЭл = Элемент.ВыделенныеЭлементы;
	
	ЭлементПланировщика = ВыделенныйЭл[0];
	ОткрытиеОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	СтруктураПараметра = Новый Структура("Ключ", ЭлементПланировщика.Значение);
	ОткрытьФорму("Документ.ЗаписьКВрачу.ФормаОбъекта", СтруктураПараметра, , , , , , ОткрытиеОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура СвободныеОкнаВрачейПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвободныеОкнаВрачейПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	ОтменаРедактирования = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнениеПланировщикаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Уволен", Ложь);
	
	СтруктураПараметров = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти
