#Область СтандартныеСобыти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаПользователей.АвтозаполнениеОтветственного(Объект.Сотрудник, Объект.Должность);
КонецПроцедуры

&НаСервере
Функция УслугиУслугаПриИзмененииНаСервере(Услуга, Должность)
	
	Если Объект.Дата = Дата('00010101') Тогда
		ДатаСозданияДокумента = ТекущаяДата();
	Иначе
		ДатаСозданияДокумента = Объект.Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНаУслугиСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаУслуги.СрезПоследних(&Период, ) КАК ЦеныНаУслугиСрезПоследних
		|ГДЕ
		|	ЦеныНаУслугиСрезПоследних.Услуга = &Услуга
		|	И ЦеныНаУслугиСрезПоследних.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Период", ДатаСозданияДокумента);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
		Если Выборка.Количество() = 0 Тогда
			Возврат 0;
		Иначе
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.Цена;
			КонецЦикла;
		КонецЕсли;
			
	
КонецФункции

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ВыборкаЦены = УслугиУслугаПриИзмененииНаСервере(ТекСтрока.Услуга, Объект.Должность);
	
	Если ВыборкаЦены <> 0 Тогда
		ТекСтрока.Стоимость = ВыборкаЦены;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У данной услуги не задана цена";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
