
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕжедневныеРасходыОстатки.СуммаРасходовОстаток) КАК СуммаРасходовОстаток
		|ИЗ
		|	РегистрНакопления.ЕжедневныеРасходы.Остатки КАК ЕжедневныеРасходыОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОстатокДенег = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокДенег = ВыборкаДетальныеЗаписи.СуммаРасходовОстаток;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	// регистр СемейныйБюджет
	Движения.СемейныйБюджет.Записывать = Истина;
	Движение = Движения.СемейныйБюджет.Добавить();
	Движение.Период = Дата;
	Движение.ЧленСемьи = ЧленСемьи;
	Движение.Месяц = Формат(Дата, "ДФ=ММММ");
	Движение.Год = Формат(Дата, "ДФ=yyyy");
	Движение.ДоступныеСредства = ОстатокДенег;
	Движение.ЛимитРасходов = Лимит;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
