#Область СтандартныеСобытия

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеМатериаловМатериалы.Материал КАК Материал,
		|	СУММА(СписаниеМатериаловМатериалы.Количество) КАК Количество
		|ПОМЕСТИТЬ втТЧМатериалы
		|ИЗ
		|	Документ.СписаниеМатериалов.Материалы КАК СписаниеМатериаловМатериалы
		|ГДЕ
		|	СписаниеМатериаловМатериалы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеМатериаловМатериалы.Материал
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Материал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧМатериалы.Материал КАК Материал,
		|	втТЧМатериалы.Количество КАК Количество
		|ИЗ
		|	втТЧМатериалы КАК втТЧМатериалы";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// Движения по регистру ОстаткиТовара
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОстаткиМатериалов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Материал = ВыборкаДетальныеЗаписи.Материал;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
	Движения.Записать();
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Материал.Представление КАК МатериалПредставление,
		|	СУММА(ОстаткиМатериаловОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	втТЧМатериалы КАК втТЧМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(
		|				&Граница,
		|				Материал В
		|					(ВЫБРАТЬ
		|						втТЧМатериалы.Материал
		|					ИЗ
		|						втТЧМатериалы КАК втТЧМатериалы)) КАК ОстаткиМатериаловОстатки
		|		ПО втТЧМатериалы.Материал = ОстаткиМатериаловОстатки.Материал
		|ГДЕ
		|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиМатериаловОстатки.Материал.Представление";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно материала " + ВыборкаДетальныеЗаписи.МатериалПредставление
			+ " в количестве: " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток) + " штук!";
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
