#Область РаботаСДанными

&НаКлиенте
Процедура ЗаполнитьАдрес(Команда)
	ОткрытьФорму("Справочник.Поставщики.Форма.ФормаАдреса");
КонецПроцедуры 

#КонецОбласти


#Область СтандартныеСобытия

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Директор = Объект.Фамилия + " " + Объект.Имя
						+ " " + Объект.Отчество;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если ИмяСобытия = "ЗаполнитьАдресПоставщика" Тогда
		Объект.Адрес = Параметр;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти