
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ДоходСУслуг.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказанныеУслугиУслуги.Услуга КАК Услуга,
		|	СУММА(ОказанныеУслугиУслуги.Стоимость) КАК Стоимость
		|ИЗ
		|	Документ.ОказанныеУслуги.Услуги КАК ОказанныеУслугиУслуги
		|ГДЕ
		|	ОказанныеУслугиУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказанныеУслугиУслуги.Услуга";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// регистр ДоходСУслуг 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ДоходСУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		Движение.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
	КонецЦикла;
	
КонецПроцедуры
