#Область РаботаСДанными

&НаКлиенте
Процедура ЗаполнитьАдрес(Команда)
	ОткрытьФорму("Справочник.Пациенты.Форма.ФормаАдреса");
КонецПроцедуры

#КонецОбласти

#Область СтандартныеСобытия

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Наименование = Объект.Фамилия + " " + Объект.Имя
						+ " " +Объект.Отчество;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	
	МассивПодстрокАдреса = СтрРазделить(Объект.Адрес, ",");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Участки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Участки КАК Участки
		|ГДЕ
		|	Участки.Адрес = &Адрес";
	
	Запрос.УстановитьПараметр("Адрес", СокрЛ(МассивПодстрокАдреса[1]));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Участок = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаполнитьАдрес" Тогда
		Объект.Адрес = Параметр;
	КонецЕсли;
	
	ОбработкаОповещенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАдрес(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Участок) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для этой улицы не задан участок";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти