#Область СтандартныеСобытия

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.РасходыНаМатериалы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходМатериаловМатериалы.Материал КАК Материал,
		|	СУММА(ПриходМатериаловМатериалы.Количество) КАК Количество,
		|	СУММА(ПриходМатериаловМатериалы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПриходМатериалов.Материалы КАК ПриходМатериаловМатериалы
		|ГДЕ
		|	ПриходМатериаловМатериалы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходМатериаловМатериалы.Материал";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// Движения по регистру ОстаткиМатериалов
		Движение = Движения.ОстаткиМатериалов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Материал = ВыборкаДетальныеЗаписи.Материал;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		// Движения по регистру РасходыНаМатериалы
		Движение = Движения.РасходыНаМатериалы.Добавить();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Материал = ВыборкаДетальныеЗаписи.Материал;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

