Процедура АвтозаполнениеОтветственного(Сотрудник, Должность) Экспорт
	
	Ответственный = ПользователиИнформационнойБазы.ТекущийПользователь();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Должность КАК Должность
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ответственный.ПолноеИмя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
			Сотрудник = ВыборкаДетальныеЗаписи.Ссылка;
			Должность = ВыборкаДетальныеЗаписи.Должность;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПользовательУволен(СсылкаНаСотрудника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СотрудникПользователь = Выборка.Ссылка.ПолучитьОбъект();
		СотрудникПользователь.Уволен = Истина;
		СотрудникПользователь.Записать();
		
		СотрудникПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Выборка.Наименование);
		СотрудникПользователь.ПоказыватьВСпискеВыбора = Ложь;
		СотрудникПользователь.Записать();
	КонецЕсли;
	
КонецПроцедуры