#Область РаботаСДанными

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)  
	
	ТекДанные = Элементы.Материалы.ТекущиеДанные;
	ИзмененниеСуммы(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент) 
	
	ТекДанные = Элементы.Материалы.ТекущиеДанные;
	ИзмененниеСуммы(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененниеСуммы(ТекДанные)
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	
	СтрокаТЧЦена = ПолучитьЦенуИзРегистра(СтрокаТЧ.Материал, Объект.Поставщик);
	
	Если СтрокаТЧЦена <> 0 Тогда
		СтрокаТЧ.Цена = СтрокаТЧЦена;
	Иначе
		СтрокаТЧ.Цена = СтрокаТЧЦена;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Организация " + Объект.Поставщик
						+ " не продаёт материал " + СтрокаТЧ.Материал;
		Сообщение.Сообщить();
	КонецЕсли;
	
	ИзмененниеСуммы(СтрокаТЧ);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуИзРегистра(СтрокаТЧМатериал, ОбъектПоставщик)
	
	Если Объект.Дата = Дата('00010101') Тогда
		ДатаСозданияДокумента = ТекущаяДата();
	Иначе
		ДатаСозданияДокумента = Объект.Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакупочныеЦеныНаМатериалыСрезПоследних.Поставщик КАК Поставщик,
		|	ЗакупочныеЦеныНаМатериалыСрезПоследних.Материал КАК Материал,
		|	ЗакупочныеЦеныНаМатериалыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЗакупочныеЦеныНаМатериалы.СрезПоследних(&Период, ) КАК ЗакупочныеЦеныНаМатериалыСрезПоследних
		|ГДЕ
		|	ЗакупочныеЦеныНаМатериалыСрезПоследних.Поставщик = &Поставщик
		|	И ЗакупочныеЦеныНаМатериалыСрезПоследних.Материал = &Материал";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ДатаСозданияДокумента));
	Запрос.УстановитьПараметр("Поставщик", ОбъектПоставщик);
	Запрос.УстановитьПараметр("Материал", СтрокаТЧМатериал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
		Если Выборка.Количество() = 0 Тогда
			Возврат 0;
		Иначе
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.Цена;
			КонецЦикла;
		КонецЕсли;
		
	КонецФункции

#КонецОбласти

#Область СтандартныеСобытия

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаПользователей.АвтозаполнениеОтветственного(Объект.Сотрудник, Объект.Должность);
КонецПроцедуры

#КонецОбласти

