
#Область НастройкиПользователей

&НаКлиенте
Процедура СоздатьПользователя(Команда)
	СоздатьПользователяНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователяНаСервере()
	НастраиваемыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НастройкиПользователей(НастраиваемыйПользователь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	НастраиваемыйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(СтарыйЛогин);
	НастройкиПользователей(НастраиваемыйПользователь);
КонецПроцедуры

&НаСервере
Процедура НастройкиПользователей(НастраиваемыйПользователь)
	
	Если НастраиваемыйПользователь <> Неопределено Тогда
		НастраиваемыйПользователь.Роли.Очистить();
		НастраиваемыйПользователь.Имя = Объект.Наименование;
		НастраиваемыйПользователь.ПолноеИмя = Объект.Сотрудник;
		НастраиваемыйПользователь.Пароль = Объект.Пароль;
	Иначе
		НастраиваемыйПользователь.Имя = Объект.Наименование;
		НастраиваемыйПользователь.ПолноеИмя = Объект.Сотрудник;
		НастраиваемыйПользователь.Пароль = Объект.Пароль;
	КонецЕсли;
	
	МетаРоли = Метаданные.Роли;
	
	Для Каждого Стр из Объект.Роли Цикл
		РольПользователя = Стр.Роль;
		НастраиваемыйПользователь.Роли.Добавить(МетаРоли.Найти(РольПользователя.Наименование));
	КонецЦикла;
	НастраиваемыйПользователь.Записать();
	
КонецПроцедуры

#КонецОбласти


#Область СтандартныеСобытия

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтарыйЛогин = Объект.Наименование;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование);
	
	Если НЕ Объект.Уволен Тогда
		Пользователь.ПоказыватьВСпискеВыбора = Истина;
		Пользователь.Записать();
	Иначе
		Пользователь.ПоказыватьВСпискеВыбора = Ложь;
		Пользователь.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
