
&НаКлиенте
Процедура НачатьРаботы(Команда)
	НачатьРаботыНаСервере();
КонецПроцедуры

&НаСервере
Процедура НачатьРаботыНаСервере()
	
	НовыйДок = Документы.ОтработаныеЧасыСотрудниками.СоздатьДокумент();
	
	Сотрудник = ПолучитьСотрудника();
	
	Если Сотрудник <> 0 Тогда
		
		НачалоРаботы = ТекущаяДата();
		
		НовыйДок.Сотрудник = Сотрудник;
		НовыйДок.Дата = НачалоРаботы;
		НовыйДок.Записать();
		
		Элементы.НачатьРаботы.Доступность = Ложь;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сотрудник не найден!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРаботу(Команда)
	ЗакончитьРаботуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакончитьРаботуНаСервере()
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Сотрудник = ПолучитьСотрудника();
	
	Если Сотрудник <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтработаныеЧасыСотрудниками.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтработаныеЧасыСотрудниками КАК ОтработаныеЧасыСотрудниками
		|ГДЕ
		|	ОтработаныеЧасыСотрудниками.Сотрудник = &Сотрудник
		|	И ОтработаныеЧасыСотрудниками.Дата = &Дата";
		
		Запрос.УстановитьПараметр("Дата", НачалоРаботы);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			КонецРаботы = ТекущаяДата();
			
			СозданныйДок = Выборка.Ссылка.ПолучитьОбъект();
			СозданныйДок.КонецРаботы = КонецРаботы;
			СозданныйДок.Записать(РежимЗаписиДокумента.Проведение);
			
			Элементы.ЗакончитьРаботу.Доступность = Ложь;
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вы ещё не начали работу";
			Сообщение.Сообщить();
		КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сотрудник не найден";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника()
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Пользователь.ПолноеИмя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
