
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЕжедневныеРасходы Приход
	Движения.ЕжедневныеРасходы.Записывать = Истина;
	Движение = Движения.ЕжедневныеРасходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.КатегорияРасходов = Справочники.КатегорииРасходов.ПополнениеБюджета;
	Движение.УчастникСемьи = УчастникСемьи;
	Движение.СуммаРасходов = СуммаПополнения;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
