#Область СтандартныеСобытия

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаПользователей.АвтозаполнениеОтветственного(Объект.Сотрудник, Объект.Должность);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗаписи");
КонецПроцедуры

#КонецОбласти

#Область РаботаСДанными

&НаСервере
Процедура УслугаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.ВремяПриема КАК ВремяПриема,
		|	ДОБАВИТЬКДАТЕ(&Дата, МИНУТА, Услуги.ВремяПриема) КАК ДатаОкончанияПриема,
		|	Услуги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Услуга);
	Запрос.УстановитьПараметр("Дата", Объект.ДатаНачалаПриема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Если Выборка.Следующий() Тогда
			Объект.ДатаОкончанияПриема = Выборка.ДатаОкончанияПриема;
			Объект.ВремяПриема = Выборка.ВремяПриема;
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Услуга или дата начала приема не задана";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УслугаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПациентПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пациенты.Участок КАК Участок
		|ИЗ
		|	Справочник.Пациенты КАК Пациенты
		|ГДЕ
		|	Пациенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Пациент);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Объект.Участок = ВыборкаДетальныеЗаписи.Участок;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У пациента " + Объект.Пациент + " не задан участок";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПациентПриИзменении(Элемент)
	ПациентПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

