
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЕжедневныеРасходы Расход
	Движения.ЕжедневныеРасходы.Записывать = Истина;
	Движение = Движения.ЕжедневныеРасходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.КатегорияРасходов = КатегорияРасходов;
	Движение.УчастникСемьи = КтоПотратил;
	Движение.СуммаРасходов = Сумма;

	// регистр МесячнаяДинамикаРасходов 
	Движения.МесячнаяДинамикаРасходов.Записывать = Истина;
	Движение = Движения.МесячнаяДинамикаРасходов.Добавить();
	Движение.Период = Дата;
	Движение.КатегорияРасходов = КатегорияРасходов;
	Движение.УчастникСемьи = КтоПотратил;
	Движение.СуммаРасходов = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
